# 算数运算的运算符

----------------------
|	运算符	|	运算  |
----------------------
|	+		| 加法运算 |
----------------------
|	-		| 减法运算 |
----------------------
|	*		| 乘法运算 |
----------------------
|	/		| 除法运算 |
----------------------
|	%   	| 取余运算 |
----------------------
|	**		| 乘方运算 |
----------------------


# integer和float运算为float对象

x.div(y) 返回x除以y后 商的整数

x.quo(y) 返回x除以y后的商，如果x、y都为整数则返回有理数（rational）

x.modulo(y) 与 x % y 等价

x.divmod(y) 将x除以y后的商和余数作为整数返回。 商是x/y去掉小数部分，余数是x%y的结果

x.remainder(y) 返回x除以y的余数，结果的符号与x符号一致