#正则表示式用于过滤字符串。

#程序中正则表达式用\\包含起来。

#也可以使用regexp.new(str)创建。
=begin
  %r(模式)
  %r<模式>
  %r|模式|
  %r!模式!
=end

# 正则表达式 =～ 字符串 是常用方法。
=begin
 根据匹配结果执行不同的处理。

 if 正则表达式 =～ 字符串
   匹配时候处理
 else
   不匹配时候处理
 end

=end

#普通模式 /ABC/ = 字符串 只要含有ABC的字符串都会罗列出来
# ^ 表示匹配首行字符 $ 表示匹配尾行 \z 用语匹配尾行，如果末尾是换行符，则匹配前一个字符串。
#[ABC] 表示匹配ABC中的一个字符，用中括号包裹起来。一定范围内的，例如A-Z 用[A-Z] 表示。 [^ABC]表示除ABC以外的字符。
# . 为匹配任意字符串，站位 1 个字符位。
# \s 表示一个空格或者换页符\t
# \d 表示匹配0-9的数字
# \w 表示英文字母和数字
# \a 表示匹配字符串开头
# \z 表示匹配字符串末尾
# 单独的 \ 可作为转换符号，为特殊的字符串转换

#正则表达式中用元字符表示重复模式
# *......重复数0次以上
# +......重复数1次以上
# ?......重复数0次或1次

#最短匹配
# *?......0次以上的重复中最短的部分
# +?......1次以上的重复中最短的部分

#适当加入括号可以重复匹配更多的内容
#例子： /^(ABC)*$/

#可以加入条件表达式
#例子：/^(ABC|DFG)$/

#quote方法的正则表达式
re1 = Regexp.new("abc*def")
re2 = Regexp.new(Regexp.quote("abc*def"))
p (re1 =~ "abc*def")
p (re2 =~ "abc*def")

#正则表达式选项
# i 忽略英文大小写。
# x 忽略正则表达式中的空白字符和#号，这样就可以在#后添加注释
# m 指定这个选项后就可以使用 . 匹配换行符