#追加元素是一种队列的 先进先出行为
#获取元素是一种栈的 后进后出行为


# -------------------------------------------------------------
# |			|	对数组开头的元素的操作	|	对数组末尾元素的操作	|
# -------------------------------------------------------------
# |追加元素 	|		unshift			|		push			|
# -------------------------------------------------------------
# |删除元素 	|		shift			|		pop				|
# -------------------------------------------------------------
# |引用元素 	|		firsh			|		last			|
# -------------------------------------------------------------

#队列数组操作
alpha = ["a", "b", "c", "d", "e"]
p alpha.push("f")
p alpha.shift
p alpha

#栈数组操作
alpha = ["a", "b", "c", "d", "e"]
p alpha.push("f")
p alpha.pop
p alpha